amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
    if (WiFi.status() == WL_CONNECTED)
    {
        if (s_config_portal_active)
        {
            console.printf("[%s] WiFi connected, stopping AP\n", TAG);
            WiFi.softAPdisconnect(true);
            s_config_portal_active = false;
        }
        if (!s_wifi_connected)
        {
            s_wifi_connected = true;
            console.printf("[%s] WiFi connected: %s\n", TAG, WiFi.localIP().toString().c_str());
            console.printf("  => Dashboard: http://%s:%d\n", WiFi.localIP().toString().c_str(), DASHBOARD_PORT);
#ifdef HABILITA_ALEXA
            console.printf("  => Alexa:     \"Alexa, ligue %s\"\n", s_device_name);
#endif
            console.printf("  => Terminal:  'h' comando de ajuda\n");
        }
        return;
    }

    if (s_config_portal_active)
    {
        if (now - s_wifi_config_start_time > 600000)
        {
            console.printf("[%s] AP config timeout, restarting\n", TAG);
            ESP.restart();
        }
        return;
    }

    if (s_wifi_connect_start > 0)
    {
        if (now - s_wifi_connect_start > 120000)
        {
            console.printf("[%s] WiFi connect timeout, starting AP\n", TAG);
            s_config_portal_active = true;
            s_wifi_config_start_time = now;
            start_ap();
            return;
        }
        if (now - s_last_reconnect_attempt >= 30000)
        {
            s_last_reconnect_attempt = now;
            console.printf("[%s] WiFi not connected, retrying...\n", TAG);
            WiFi.reconnect();
        }
    }
    else
    {
        s_wifi_connect_start = now;
        WiFi.begin();
    }
}

static void handle_api_wifi(void)
{
    if (s_server.method() == HTTP_GET)
    {
        String json;
        JsonDocument doc;
        doc["ssid"] = WiFi.SSID();
        doc["configured"] = (WiFi.SSID().length() > 0);
        doc["ap_active"] = s_config_portal_active;
        doc["status"] = (WiFi.status() == WL_CONNECTED) ? "connected" : "disconnected";
        doc["device_name"] = s_device_name;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
        return;
    }

    if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        if (doc.containsKey("ssid"))
        {
            const char *ssid = doc["ssid"];
            const char *pass = doc["password"] | "";

            if (doc.containsKey("device_name"))
            {
                const char *new_name = doc["device_name"];
                if (is_valid_name(new_name) && strcmp(s_device_name, new_name) != 0)
                {
                    strncpy(s_device_name, new_name, sizeof(s_device_name) - 1);
                    s_device_name[sizeof(s_device_name) - 1] = '\0';
                    save_device_name(s_device_name);
                }
            }

#ifdef HABILITA_REPEATER
            if (doc.containsKey("repeater_mac"))
            {
                const char *mac_str = doc["repeater_mac"];
                if (strlen(mac_str) > 0 && mac_parse(mac_str, s_gateway_mac))
                {
                    s_use_repeater = true;
                    s_paired = true;
                    save_gateway_mac(s_gateway_mac);
                }
            }
#endif

            console.printf("[%s] WiFi credentials received, connecting to %s...\n", TAG, ssid);
            s_server.send(200, "application/json", "{\"status\":\"ok\",\"message\":\"Connecting...\"}");
            save_wifi_credentials(ssid, pass);
            delay(100);
            WiFi.begin(ssid, pass);
            s_config_portal_active = false;
            s_wifi_connect_start = millis();
        }
        else
        {
            s_server.send(400, "application/json", "{\"error\":\"missing ssid\"}");
        }
    }
}

static void serve_pgm_page(const char *page)
{
    size_t total = strlen_P(page);
    WiFiClient cl = s_server.client();
    cl.print(F("HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nContent-Length: "));
    cl.print(total);
    cl.print(F("\r\nConnection: close\r\n\r\n"));
    PGM_P src = page;
    char buf[256];
    while (total > 0)
    {
        size_t chunk = total > sizeof(buf) ? sizeof(buf) : total;
        memcpy_P(buf, src, chunk);
        cl.write((const uint8_t *)buf, chunk);
        src += chunk;
        total -= chunk;
        yield();
    }
}

static void handle_root(void)
{
    if (s_config_portal_active)
    {
        s_server.send(200, "text/html", FPSTR(PAGE_WIFI_CONFIG));
        return;
    }
    String page;
    page.reserve(4096);
    page = FPSTR(PAGE_DASHBOARD);
    page += FPSTR(PAGE_PINS_NAV);
    page += FPSTR(PAGE_DASHBOARD_CONT1);
    page += FPSTR(PAGE_PINS_SEC);
#ifdef HABILITA_REPEATER
    page += FPSTR(PAGE_DASHBOARD_REPEATER_CFG);
#endif
    page += FPSTR(PAGE_DASHBOARD_CONT3);
    page += FPSTR(PAGE_DASHBOARD_CONT2);
    page += FPSTR(PAGE_SCRIPT_PINS);
    page += FPSTR(PAGE_DASHBOARD_END);
    serve_pgm_page(page.c_str());
}

static void handle_api_state(void)
{
    String json;
    {
        JsonDocument doc;
        doc["state"] = s_relay_state;
        doc["button"] = (digitalRead(s_button_pin) == LOW);
        doc["battery"] = s_battery;
        doc["device_id"] = s_device_id;
        doc["device_name"] = s_device_name;
        doc["gateway_connected"] = s_gateway_connected;
        doc["paired"] = s_paired;
        doc["ip"] = WiFi.localIP().toString();
        doc["rssi"] = WiFi.RSSI();
        char upbuf[32];
        uptime_to_str(millis() - s_start_time, upbuf, sizeof(upbuf));
        doc["uptime"] = upbuf;
        if (s_last_send_ms)
            doc["last_send_s"] = (millis() - s_last_send_ms) / 1000;
        doc["slot"] = s_assigned_slot;
       #ifdef  HABILITA_ALEXA
        doc["alexa_connected"] = (s_last_alexa_activity > 0 && (millis() - s_last_alexa_activity < 600000));
        #endif
#ifdef LED_PIN
        doc["led_enabled"] = (s_led_enabled ? "true" : "false");
        doc["led_state"] = (digitalRead(LED_PIN) == LED_ON ? "LIGADO" : "DESLIGADO");
#endif
        doc["fw_version"] = FW_VERSION;
        doc["tx_count"] = s_espnow_tx_count;
        doc["rx_count"] = s_espnow_rx_count;
        doc["on_count"] = s_on_count;
        doc["free_heap"] = ESP.getFreeHeap();
#ifdef HABILITA_REPEATER
        doc["repeater_supported"] = true;
        doc["repeater_active"] = (s_repeater_fwd > 0) || s_use_repeater;
        doc["repeater_enabled"] = s_use_repeater;
        if (s_use_repeater)
        {
            doc["repeater_fwd"] = s_repeater_fwd;
            JsonArray rep_clients = doc["repeater_clients"].to<JsonArray>();
            for (int i = 0; i < s_rep_client_num; i++)
            {
                JsonObject obj = rep_clients.add<JsonObject>();
                char mac_str[18];
                mac_to_str(s_rep_clients[i].mac, mac_str, sizeof(mac_str));
                obj["mac"] = mac_str;
                obj["packets"] = s_rep_clients[i].pkt_count;
            }
        }
#endif
        if (s_tz_changed)
            doc["timezone"] = s_timezone_offset;
        serializeJson(doc, json);
    }
    s_server.send(200, "application/json", json);
}

