amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
static void handle_api_relay(void)
{
    if (s_server.method() == HTTP_GET)
    {
        String json;
        JsonDocument doc;
        doc["state"] = s_relay_state;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        if (doc.containsKey("state"))
        {
            bool new_state = doc["state"];
            set_relay(new_state);
            console.printf("[%s] Relay set to %s via API\n", TAG, new_state ? "ON" : "OFF");
            String json;
            JsonDocument resp;
            resp["state"] = s_relay_state;
            resp["status"] = "ok";
            serializeJson(resp, json);
            s_server.send(200, "application/json", json);
            s_last_state_update = 0;
        }
        else
        {
            s_server.send(400, "application/json", "{\"error\":\"missing state\"}");
        }
    }
}

#ifdef HABILITA_REPEATER
static void handle_api_repeater(void)
{
    if (s_server.method() == HTTP_GET)
    {
        String json;
        JsonDocument doc;
        doc["enabled"] = s_use_repeater;
        doc["forwarded"] = s_repeater_fwd;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        if (doc.containsKey("enabled"))
        {
            bool en = doc["enabled"];
            s_use_repeater = en;
            save_repeater_en();
            console.printf("[%s] Repeater %s via API\n", TAG, en ? "ATIVADO" : "desativado");
            String json;
            JsonDocument resp;
            resp["enabled"] = s_use_repeater;
            resp["status"] = "ok";
            serializeJson(resp, json);
            s_server.send(200, "application/json", json);
        }
        else
        {
            s_server.send(400, "application/json", "{\"error\":\"missing enabled\"}");
        }
    }
}
#endif

static void handle_api_pin(void)
{
    if (s_server.method() == HTTP_GET)
    {
        int pin = s_server.arg("gpio").toInt();
        pinMode(pin, INPUT_PULLUP);
        int state = digitalRead(pin);
        String json;
        JsonDocument doc;
        doc["gpio"] = pin;
        doc["state"] = state;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        int pin = doc["gpio"] | -1;
        if (pin < 0 || pin > 16)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid gpio\"}");
            return;
        }
        int state = doc["state"] | -1;
        if (state != 0 && state != 1)
        {
            s_server.send(400, "application/json", "{\"error\":\"state must be 0 or 1\"}");
            return;
        }
        pinMode(pin, OUTPUT);
        digitalWrite(pin, state);
        String json;
        JsonDocument resp;
        resp["gpio"] = pin;
        resp["state"] = state;
        resp["status"] = "ok";
        serializeJson(resp, json);
        s_server.send(200, "application/json", json);
    }
}

#ifdef HABILITA_PINOS
static uint32_t GPIOMUX[17] = {
    0x000, // GPIO0
    0x000, // GPIO1
    0x000, // GPIO2
    0x000, // GPIO3
    0x000, // GPIO4
    0x000, // GPIO5
    0x000, // GPIO6
    0x000, // GPIO7
    0x000, // GPIO8
    0x000, // GPIO9
    0x000, // GPIO10
    0x000, // GPIO11
    0x000, // GPIO12
    0x000, // GPIO13
    0x000, // GPIO14
    0x000, // GPIO15
    0x000  // GPIO16
};
static uint8_t getMode(int pin)
{
    if (pin < 0 || pin > 16)
        return 0xFF;
    uint32_t reg = GPIOMUX[pin];
    if (reg & 0x100)
        return OUTPUT;
    else if (reg & 0x200)
        return INPUT_PULLUP;
    else
        return INPUT;
}
static void handle_api_pins(void)
{
    String json;
    {
        JsonDocument doc;
        JsonArray arr = doc["pins"].to<JsonArray>();
        for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
        {
            int gpio = AVAILABLE_GPIOS[i];
            JsonObject obj = arr.add<JsonObject>();
            obj["gpio"] = gpio;
            obj["state"] = digitalRead(gpio);
            uint8_t mode = getMode(gpio);
            obj["mode"] = (mode == OUTPUT) ? "OUT" : (mode == INPUT_PULLUP) ? "IN_PU" : "IN";
        }
        serializeJson(doc, json);
    }
    s_server.send(200, "application/json", json);
}
#endif

static void handle_console(char c)
{
    switch (c)
    {
    case 'R':
    case 'r':
        ESP.restart();
        break;
    case 'l':
    case 'L':
    {
        console.printf("\n--- Controle da Lampada ---\n");
        toggle_relay();
        console.printf("  Lampada: %s\n", s_relay_state ? "LIGADA" : "DESLIGADA");
        if (s_paired)
        {
            s_last_espnow_send = 0;
            if (espnow_send_data())
                s_last_send_ms = millis();
        }
        else
        {
            console.printf("  (gateway nao pareado)\n");
        }
        console.printf("--------------------------\n\n");
        break;
    }
    case '0':
        set_relay(false);
        console.printf("[%s] Relay OFF\n", TAG);
        if (s_paired)
        {
            s_last_espnow_send = 0;
            espnow_send_data();
        }
        break;
    case '1':
        set_relay(true);
        console.printf("[%s] Relay ON\n", TAG);
        if (s_paired)
        {
            s_last_espnow_send = 0;
            espnow_send_data();
        }
        break;
    case 'u':
    case 'U':
        console.printf("\n--- OTA ---\n");
        console.printf("  Hostname: %s.local\n", s_device_id);
        console.printf("  Port:     8266 (ArduinoOTA)\n");
        console.printf("  PlatformIO CLI:\n");
        console.printf("    pio run -t upload --upload-port %s.local\n", s_device_id);
        console.printf("  espota.py:\n");
        console.printf("    espota.py -i %s.local -p 8266 -f firmware.bin\n", s_device_id);
        console.printf("-------------\n\n");
        break;
    case 'p':
    case 'P':
    {
        console.printf("\n--- Par ---\n");
        s_paired = false;
        s_gateway_connected = false;
        s_pair_attempts = 0;
        console.printf("  Estado de pareamento resetado\n");
        console.printf("  Enviando requisicao de par...\n");
        if (espnow_send_pair_request())
            console.printf("  Requisicao enviada!\n");
        else
            console.printf("  Falha ao enviar requisicao\n");
        console.printf("----------------\n\n");
        break;
    }
    case 'h':
    case 'H':
    case '?':
        console.printf("\n--- Comandos ---\n");
        console.printf("  l    - liga/desliga lampada\n");
        console.printf("  0    - desligar\n");
        console.printf("  1    - ligar\n");
        console.printf("  r    - reset\n");
        console.printf("  s    - status do dispositivo\n");
        console.printf("  p    - resetar par e tentar parear\n");
#ifdef HABILITA_REPEATER
        console.printf("  e    - ligar/desligar repeater\n");
        console.printf("  x    - repeater stats\n");
#endif
        console.printf("  c    - zerar contadores\n");
        console.printf("  u    - info OTA\n");
        #ifdef HABILITA_ALEXA
        console.printf("  a    - info Alexa\n");
        #endif
        console.printf("  h/?  - esta ajuda\n");
        console.printf("  Dashboard: http://%s:%d\n", WiFi.localIP().toString().c_str(), DASHBOARD_PORT);
        if (s_paired)
        {
            char mac_str[18];
            mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
            console.printf("  Gateway: %s (slot %d)\n", mac_str, s_assigned_slot);
        }
        console.printf("  IP local: %s\n", WiFi.localIP().toString().c_str());
        console.printf("  RSSI:     %d dBm\n", WiFi.RSSI());
        char upbuf[32];
        uptime_to_str(millis() - s_start_time, upbuf, sizeof(upbuf));
        console.printf("  Up:       %s\n", upbuf);
        console.printf("----------------\n\n");
        break;
   #ifdef HABILITA_ALEXA     
    case 'a':
    case 'A':
        console.printf("\n--- Alexa ---\n");
        console.printf("  Dispositivo: %s\n", s_device_name);
        console.printf("  Protocolo:   Hue Bridge (SSDP + UPnP)\n");
        console.printf("  Dica:        \"Alexa, ligue %s\"\n", s_device_name);
        console.printf("               \"Alexa, desligue %s\"\n", s_device_name);
        console.printf("             Acesse http://%s/espalexa para status\n", WiFi.localIP().toString().c_str());
        console.printf("-------------\n\n");
        break;
        #endif
#ifdef HABILITA_REPEATER
    case 'e':
    case 'E':
        s_use_repeater = !s_use_repeater;
        save_repeater_en();
        console.printf("[%s] Repeater %s\n", TAG, s_use_repeater ? "ATIVADO" : "DESATIVADO");
        break;
    case 'x':
    case 'X':
        if (s_use_repeater)
        {
            console.printf("\n--- Repeater Stats ---\n");
            console.printf("  Forwarded: %lu\n", s_repeater_fwd);
            console.printf("  Clients:   %d\n", s_rep_client_num);
            for (int i = 0; i < s_rep_client_num; i++)
            {
                char mac_str[18];
                mac_to_str(s_rep_clients[i].mac, mac_str, sizeof(mac_str));
                console.printf("  %d: %s (%lu pkts)\n", i, mac_str, s_rep_clients[i].pkt_count);
            }
            console.printf("----------------------\n\n");
        }
        else
        {
            console.printf("[%s] Repeater mode disabled\n", TAG);
        }
        break;
#endif
    case 'c':
    case 'C':
        s_espnow_tx_count = 0;
        s_espnow_rx_count = 0;
        s_on_count = 0;
#ifdef HABILITA_REPEATER
        s_repeater_fwd = 0;
        for (int i = 0; i < s_rep_client_num; i++)
            s_rep_clients[i].pkt_count = 0;
#endif
        console.printf("[%s] Contadores zerados\n", TAG);
        break;
    case 's':
    case 'S':
    {
        unsigned long up = (millis() - s_start_time) / 1000;
        console.printf("\n--- Status ---\n");
        console.printf("  Dispositivo: %s\n", s_device_id);
        console.printf("  Nome:        %s\n", s_device_name);
        console.printf("  Lampada:     %s\n", s_relay_state ? "LIGADA" : "DESLIGADA");
        console.printf("  Bateria:     %d %%\n", s_battery);

